bundled_packages_dir: packages
data_dir: data
control_server_host: "*"
description: null
environment_variables: {}
examples_filename: examples.yaml
external_package_dirs: []
input_type: Any
live_reload: false
model_class_filename: model.py
model_class_name: Model
model_framework: huggingface_transformer
model_metadata:
  has_hybrid_args: true
  has_named_args: false
  transformer_config:
    model: gpt2
model_module_dir: model
model_name: null
model_type: text-generation
python_version: py39
requirements:
- transformers==4.26.1
resources:
  cpu: 500m
  memory: 512Mi
  use_gpu: true
secrets: {}
spec_version: '2.0'
system_packages: []
train:
  resources:
    cpu: 500m
    memory: 512Mi
    use_gpu: false
  training_class_filename: train.py
  training_class_name: Train
  training_module_dir: train
  variables: {}
